In [2]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("mysql").getOrCreate()

In [1]:
import pandas as pd
import mysql.connector

conn = mysql.connector.connect(host = "localhost",user="root",
                               password='1994',
                               database='campusx',
                               ssl_disabled=True)

df = pd.read_sql_query("SELECT * FROM college" , conn)

conn.close()

df.head()

C:\Users\TARUN\AppData\Local\Temp\ipykernel_6676\3939164298.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("SELECT * FROM college" , conn)

   Year    State             Type  Length       Expense  Value
0  2013  Alabama          Private  4-year  Fees/Tuition  13983
1  2013  Alabama          Private  4-year    Room/Board   8503
2  2013  Alabama  Public In-State  2-year  Fees/Tuition   4048
3  2013  Alabama  Public In-State  4-year  Fees/Tuition   8073
4  2013  Alabama  Public In-State  4-year    Room/Board   8473

In [3]:
spark_df = spark.createDataFrame(df)
spark_df.show()

+----+-------+-------------------+------+------------+-----+
|Year|  State|               Type|Length|     Expense|Value|
+----+-------+-------------------+------+------------+-----+
|2013|Alabama|            Private|4-year|Fees/Tuition|13983|
|2013|Alabama|            Private|4-year|  Room/Board| 8503|
|2013|Alabama|    Public In-State|2-year|Fees/Tuition| 4048|
|2013|Alabama|    Public In-State|4-year|Fees/Tuition| 8073|
|2013|Alabama|    Public In-State|4-year|  Room/Board| 8473|
|2013|Alabama|Public Out-of-State|2-year|Fees/Tuition| 7736|
|2013|Alabama|Public Out-of-State|4-year|Fees/Tuition|20380|
|2013|Alabama|Public Out-of-State|4-year|  Room/Board| 8473|
|2013| Alaska|            Private|4-year|Fees/Tuition|21496|
|2013| Alaska|            Private|4-year|  Room/Board| 8923|
|2013| Alaska|    Public In-State|2-year|Fees/Tuition| 3972|
|2013| Alaska|    Public In-State|4-year|Fees/Tuition| 6317|
|2013| Alaska|    Public In-State|4-year|  Room/Board| 9098|
|2013| Alaska|Public Out-of-State|2-year|Fees/Tuition| 4150|
|2013| Alaska|Public Out-of-State|4-year|Fees/Tuition|18790|
|2013| Alaska|Public Out-of-State|4-year|  Room/Board| 9098|
|2013|Arizona|            Private|4-year|Fees/Tuition|11650|
|2013|Arizona|            Private|4-year|  Room/Board| 8744|
|2013|Arizona|    Public In-State|2-year|Fees/Tuition| 1842|
|2013|Arizona|    Public In-State|4-year|Fees/Tuition| 9694|
+----+-------+-------------------+------+------------+-----+
only showing top 20 rows

In [4]:
spark_df.printSchema()

root
 |-- Year: long (nullable = true)
 |-- State: string (nullable = true)
 |-- Type: string (nullable = true)
 |-- Length: string (nullable = true)
 |-- Expense: string (nullable = true)
 |-- Value: long (nullable = true)

In [6]:
spark.stop()